#include "Header.h"
//#pragma warning(disable : 4996) //_CRT_SECURE_NO_WARNINGS

/*7. Створити файл з інформацією про наявність лікарських ампул: 
назва, термін дії після відкриття (за шаблоном - ГГ:ХХ), термін зберігання(роки) нерозпакованої ампули.
Створити новий файл, який містить інформацію про розкриті ампули: назва ліків, час відкриття (вводяться користувачем)
та термін, до якого ампула має бути використана (розраховується згідно з даними з першого файлу).
Видалити з нового файлу інформацію про ампули,термін зберігання яких у відкритому вигляді закінчився.*/

int main()
{
	string f1_name = create_first_file();
	print_file1(f1_name);
	string file2_name;
	string f2_name = create_second_file(f1_name);
	print_file2(f2_name);
	delete_expired(f2_name);
	print_file2(f2_name);
}